#include<stdio.h>
int main(void)
{
	int a[10] = { 0 },b,c,sum=0;
	for (int i = 123; i < 329; i++)
		//因为不可重复使用，故最大三位数为987，则其对应的最小三位数为987/3=329，最小三位数的最小值为123，所以最小三位数的范围为[123,329]
	{
		b = 2 * i;
		c = 3 * i;
		a[i / 100] = a[(i % 100) / 10] = a[(i % 100) % 10] = 1;
		a[b / 100] = a[(b % 100) / 10] = a[(b % 100) % 10] = 1;
		a[c / 100] = a[(c % 100) / 10] = a[(c % 100) % 10] = 1;
		//为a[使用过的数字]赋值为1
		for (size_t j = 0; j < 11; j++)
		{
			sum += a[j];
		}
		if (sum == 9)//如果1-9全部使用，那么a[10]之和则为9
			printf("%d %d %d\n", i, b, c);
		for (size_t k = 0; k < 11; k++)
		{
			a[k] = 0;
		}//为a[10]重新赋值
		sum = 0;
	}
	getchar();
	return 0;
}